RIET/src/Tasks/УтверждениеКН/УтверждениеКН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>УтверждениеКН</name>
  <addressing>InformationRegister.АдресацияУведомлений</addressing>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыУтвержденияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитНота</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Утверждать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровестиНаДатуКредитНоты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <addressingAttributes>
    <name>ИнвойсинговыйЦентр</name>
    <type>
      <types>CatalogRef.ИнвойсинговыеЦентры</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

RIET/src/InformationRegisters/СтатусыУтвержденияКорректировок/СтатусыУтвержденияКорректировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыУтвержденияКорректировок</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыУтвержденияОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоУтвердивших</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоУтверждающих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КредитНота</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Tasks/УтверждениеКН/Forms/ФормаЗадачиУправляемая/Module.bsl
////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Выполнена Тогда
		Элементы.Выполнена.Видимость = Истина;
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтклонить.Доступность = Ложь;
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаУтвердить.Доступность = Ложь;
	КонецЕсли;
	Если Объект.Утверждать = Ложь Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтклонить.Доступность = Ложь;
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаУтвердить.Доступность = Ложь;
	КонецЕсли;
	
	ОбновитьСтатусКН();

	Попытка
		НомерСФ = ОбщегоНазначения.НайтиПодчиненныйДокумент(Объект.КредитНота.Сделка, "СчетФактураВыданный").Номер;
		
		СуммаСторнируемогоДокумента  = Объект.КредитНота.Сделка.СуммаДокумента;
		ДатаСторнируемогоДокумента   = Объект.КредитНота.Сделка.Дата;
		ВалютаСторнируемогоДокумента = Объект.КредитНота.Сделка.ВалютаДокумента;
	Исключение
	КонецПопытки;

	Если Объект.ПровестиНаДатуКредитНоты = 0 Тогда
		Объект.ПровестиНаДатуКредитНоты = 1;
		Объект.ДатаПроведения = Объект.КредитНота.Дата;
	КонецЕсли;
	
	УправлениеВидимостью();
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусКН()
	
	ЗаписьВРегистре = РегистрыСведений.СтатусыУтвержденияКорректировок.Получить(Новый Структура("КредитНота",Объект.КредитНота));
	Объект.Статус = ЗаписьВРегистре.Статус;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Если Объект.ПровестиНаДатуКредитНоты = 3 Тогда
		Элементы.ДатаПроведения.Видимость = Истина;
		Элементы.Декорация.Видимость = Истина;
	Иначе
		Элементы.ДатаПроведения.Видимость = Ложь;
		Элементы.Декорация.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиНаДатуКредитНотыПриИзменении(Элемент)
	
	ПриИзмененииРеквизитаПровестиНаДатуКредитНоты();
	      	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииРеквизитаПровестиНаДатуКредитНоты()
	
	УправлениеВидимостью();
	
	Если Объект.ДатаПроведения = Дата(1,1,1) Тогда
		Объект.ДатаПроведения = Объект.КредитНота.Дата;
	КонецЕсли;
	
	Если Объект.ПровестиНаДатуКредитНоты = 1 Тогда
		
		Объект.ДатаПроведения = Объект.КредитНота.Дата;
		
	ИначеЕсли Объект.ПровестиНаДатуКредитНоты = 2 Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.КредитНота.Сделка) Тогда
		     ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			 	"В кредит-ноте не заполнен документ расчетов. Дата сторнируемого документа не может быть определена.");
			 Объект.ПровестиНаДатуКредитНоты = 1;
		Иначе	
			Объект.ДатаПроведения = Объект.КредитНота.Сделка.Дата;
		КонецЕсли; 
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если Объект.Утверждать = Ложь Тогда
		Выполнена = Истина;
		Записать(новый Структура);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////
// КОМАНДЫ
////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура Утвердить(Команда)
	
	УтвердитьНаСервере();
     		
КонецПроцедуры

&НаСервере
Процедура УтвердитьНаСервере() 
	
	Если Объект.ПровестиНаДатуКредитНоты = 1 Тогда
		Объект.ДатаПроведения = Объект.КредитНота.Дата;
	ИначеЕсли Объект.ПровестиНаДатуКредитНоты = 2 Тогда
		Объект.ДатаПроведения = Объект.КредитНота.Сделка.Дата;
	КонецЕсли;

	КредитНотаОбъект = Объект.КредитНота.ПолучитьОбъект();
	КредитНотаОбъект.ДатаПроведения = Объект.ДатаПроведения;
	КредитНотаОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		КредитНотаОбъект.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не удалось записать документ " + КредитНотаОбъект +": " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	ТекЗадача = РеквизитФормыВЗначение("Объект");
	ТекЗадача.ВыполнитьЗадачу();
	
	ОбновитьСтатусКН();
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтклонить.Доступность = Ложь;
    Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаУтвердить.Доступность = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	ОтклонитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                |	УтверждениеКН.КредитНота,
	                |	УтверждениеКН.Статус,
	                |	УтверждениеКН.Ссылка
	                |ИЗ
	                |	Задача.УтверждениеКН КАК УтверждениеКН
	                |ГДЕ
	                |	УтверждениеКН.КредитНота = &КредитНота
	                |	И УтверждениеКН.Статус = &Статус";
	Запрос.УстановитьПараметр("КредитНота",Объект.КредитНота);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗадачаОбъект.Выполнена = Истина;
		ЗадачаОбъект.Утверждать = Ложь;
		ЗадачаОбъект.Записать();
	КонецЦикла;
	
	ЗаписьОСтатусе = РегистрыСведений.СтатусыУтвержденияКорректировок.СоздатьМенеджерЗаписи();
	ЗаписьОСтатусе.КредитНота = Объект.КредитНота;
	ЗаписьОСтатусе.Прочитать();
	ЗаписьОСтатусе.Записать();
	
	Выполнена = Истина;
		
	ОбновитьСтатусКН();
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаУтвердить.Доступность = Ложь;
	
КонецПроцедуры
